---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LegendComponentView
source: html/71709d85-0542-d545-4137-e6002609d18f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LegendComponentView Property

"View Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId LegendComponentView { get; }
```